Repository: alexandrenorman/zxcvbn-python
Catalog: zxcvbn/locale/*/LC_MESSAGES/messages.po
Languages: de_de, it_it

source: Use a few words, avoid common phrases.
de_de: Verwende ein paar Wörter, vermeide gängige Redewendungen.
it_it: Usa alcune parole, evita frasi comuni.

source: No need for symbols, digits, or uppercase letters.
de_de: Keine Notwendigkeit für Symbole, Ziffern oder Großbuchstaben.
it_it: Non c'è bisogno di simboli, numeri o lettere maiuscole.

source: Add another word or two. Uncommon words are better.
de_de: Füge ein oder zwei weitere Wörter hinzu. Ungewöhnliche Wörter sind besser.
it_it: Aggiungi una o due parole. Le parole insolite sono migliori.

source: Straight rows of keys are easy to guess.
de_de: Gerade Tastenreihen sind leicht zu erraten.
it_it: Le righe dritte di tasti sono facili da indovinare.

source: Short keyboard patterns are easy to guess.
de_de: Kurze Tastaturmuster sind leicht zu erraten.
it_it: I brevi schemi di tastiera sono facili da indovinare.

source: Use a longer keyboard pattern with more turns.
de_de: Verwende ein längeres Tastaturmuster mit mehr Richtungswechseln.
it_it: Usa uno schema di tastiera più lungo con più svolte.

source: Repeats like "aaa" are easy to guess.
de_de: Wiederholungen wie "aaa" sind leicht zu erraten.
it_it: Ripetizioni come "aaa" sono facili da indovinare.

source: Repeats like "abcabcabc" are only slightly harder to guess than "abc".
de_de: Wiederholungen wie "abcabcabc" sind nur etwas schwerer zu erraten als "abc".
it_it: Ripetizioni come "abcabcabc" sono solo leggermente più difficili da indovinare rispetto a "abc".

source: Avoid repeated words and characters.
de_de: Vermeide wiederholte Wörter und Zeichen.
it_it: Evita parole e caratteri ripetuti.

source: Sequences like "abc" or "6543" are easy to guess.
de_de: Sequenzen wie "abc" oder "6543" sind leicht zu erraten.
it_it: Sequenze come "abc" o "6543" sono facili da indovinare.

source: Avoid sequences.
de_de: Vermeide Sequenzen.
it_it: Evita le sequenze.

source: Recent years are easy to guess.
de_de: Aktuelle Jahreszahlen sind leicht zu erraten.
it_it: Gli anni recenti sono facili da indovinare.

source: Avoid recent years.
de_de: Vermeide aktuelle Jahreszahlen.
it_it: Evita gli anni recenti.

source: Avoid years that are associated with you.
de_de: Vermeide Jahreszahlen, die mit dir in Verbindung stehen.
it_it: Evita anni associati a te.

source: Dates are often easy to guess.
de_de: Daten sind oft leicht zu erraten.
it_it: Le date sono spesso facili da indovinare.

source: Avoid dates and years that are associated with you.
de_de: Vermeide Daten und Jahreszahlen, die mit dir in Verbindung stehen.
it_it: Evita date e anni associati a te.

source: This is a top-10 common password.
de_de: Dies ist eines der 10 häufigsten Passwörter.
it_it: Questa è una delle 10 password più comuni.

source: This is a top-100 common password.
de_de: Dies ist eines der 100 häufigsten Passwörter.
it_it: Questa è una delle 100 password più comuni.

source: This is a very common password.
de_de: Dies ist ein sehr häufiges Passwort.
it_it: Questa è una password molto comune.

source: This is similar to a commonly used password.
de_de: Dies ähnelt einem häufig verwendeten Passwort.
it_it: Questa è simile a una password comunemente usata.

source: A word by itself is easy to guess.
de_de: Ein einzelnes Wort ist leicht zu erraten.
it_it: Una singola parola è facile da indovinare.

source: Names and surnames by themselves are easy to guess.
de_de: Vor- und Nachnamen allein sind leicht zu erraten.
it_it: Nomi e cognomi da soli sono facili da indovinare.

source: Common names and surnames are easy to guess.
de_de: Häufige Vor- und Nachnamen sind leicht zu erraten.
it_it: Nomi e cognomi comuni sono facili da indovinare.

source: Capitalization doesn't help very much.
de_de: Großschreibung hilft nicht viel.
it_it: L'uso delle maiuscole non aiuta molto.

source: All-uppercase is almost as easy to guess as all-lowercase.
de_de: Nur Großbuchstaben sind fast so leicht zu erraten wie nur Kleinbuchstaben.
it_it: Tutto in maiuscolo è quasi facile da indovinare quanto tutto in minuscolo.

source: Reversed words aren't much harder to guess.
de_de: Umgedrehte Wörter sind nicht viel schwerer zu erraten.
it_it: Le parole invertite non sono molto più difficili da indovinare.

source: Predictable substitutions like '@' instead of 'a' don't help very much.
de_de: Vorhersehbare Ersetzungen wie '@' statt 'a' helfen nicht viel.
it_it: Sostituzioni prevedibili come '@' al posto di 'a' non aiutano molto.
